package report.parkjonghun.memo;

public class Memo3 {
//	운영체제 설명.
//	윈도우
//	도스를 대체한 MS의 운영체제
//	1992년 버전 3.1을 시작으로 점점 발전하기 시작한 GUI 운영체제.
//	윈도우 95부터 완전한 운영체제로 도스를 완벽하게 대처할 수 있게됨.
//	
//	유닉스
//	1969년 벨 연구소에서 개발되어 현재까지 꾸준히 발전을 하는 운영체제
//	보안에 강력한만큼 사용도 어려우며 라이센스가 비용이 비쌈
//	프로그래머의 능력 향상을 위한 다양한 유틸리티 제공
//	
//	리눅스
//	Linus Torvals에 의해 1991년에 만들어짐.
//	인텔 CPU에 장착한 PC에 설치 가능
//	공개를 원칙으로 하기 때문에 무료 사용 가능.
	
	
//	데이터 베이스
//	create database IOT_TEST; /* 데이터 베이스  만들기.*/
//
//	use iot_test; /* iot_test 폴더를 사용하겠다 */
//
//	create table test(
//		id varchar(30),
//		pwd varchar(30),
//		name varchar(30)
//	);
//
//
//	이클립스에서 웹서버를 로컬로 실행하기 위한 프로그램 설치 및 셋팅을 서술하시오.
//	1. JDK 설치 다운로드 주소 :  링크 주소는 위에 오른쪽 클릭 링크주소.
//	2. 이클립스 설치 : 다운로드 주소 : (다운받아 압출품) 다운로드 링크 맨 끝 파일명만 적어도 됨.
//        3. 톰캣8.5 설치 : 다운로드 주소 : 64비트로 (zip파일 다운로드)
//	4. 다운 받아 압축 품
//	5. 이클립스에 톰캣설정 
//	6. 서버 하단 파란글씨 적기.
//  7. 들어가서 피니쉬 누르면 끝.
//  
//	http의 기본 포트는 무엇이며 이클립스에 셋팅하는 서버(톰캣)에서 포트를 바꾸는 방법을 서술하시오.
//	- 이클립스 서버에서 톰캣 서버 더블클릭 후 ports에서 http port Number을 변경.

// 국제 네트워크 표준 모델인 OSI7 계층도를 작성해주세요.
//	  7계층  -  Application   -  사용자 인터페이스 / 응용 프로그램
//	  6계층  -  Presentation  -  데이터 포맷 / 암호화
//	  5계층  -  Session       -  연결 유지
//	  4계층  -  Transport     -  패킷 생성 / 패킷 오류 관리
//	  3계층  -  Network       -  논리적 주소 관리 / 경로 설정
//	  2계층  -  Data Link     -  물리적 주소 관리
//	  1계층  -  Physical      -  네트워크의 물리적 구조(케이블, 신호방식)
//	
// 네트워크의 종류 중 근거리 통신망 (LAN : Local area Network)에 대해 서술해주세요.
//  300m 이하의 통신회선으로 연결된 통신망이다.
//	네트워크 매체를 이용하여 집,사무실,학교등의 건물과 같은 가까운 지역을 한데 묶는 컴퓨터 네트워크이다.
//	한정된 지역에서 컴퓨터를 기본으로 하는 여러가지 전자기기 사이의 자유로운 정보교환 가능한 것이 특징이다.
	
}
	