package report.parkjonghun.r0006;

public class Memo {

//	오버 로딩의 조건.
//	1. 클래스 명이 동일해야한다.
//	2. 파라미터의 숫자가 달라야한다.
//	3. 파라미터 타입이 달라야한다.
//
//	오버 라이딩이란?
//	상속받을 시에만 사용하며 함수를 재정의하여 사용하는 것을 오버라이딩이라고 한다.

//	ex) Father 클래스 안에 같은 명의 함수가 있을 시 Son클래스에서 같은 명의 함수를 
//	재정의하여 Son클래스의 같은 명의 함수를 사용하는 것.
//	
//	명시적 : 내가 누구인지 설명해줘야 하는 것.
//
//	규칙(데이터 타입)
//	Class :  첫단어 대문자. 두번째 단어 대문자 ex) ExamNew
//	int : 첫단어 소문자 두번째 단어 대문자 ex) numNew
//	String : 첫단어 소문자. 두번째 단어 대문자 ex) stringNew
//
//	&& : and (둘다 참이여야한다)
//	|| : or  (둘 중하나가 참이라면)
//
//	if 문
//	두개가 참이라도 맨앞에 if만 실행됨.
//	두개를 참으로 할려면 if문을 하나 더 만들어야함.
//	if(a == 1){
//
//	}esle if(b==3){
//	}
//
//	접근 변경자 공부하기.
//	public, protected, default, private
//  참고 자료 주소 : http://uniksy1106.tistory.com/173


//	
}
