package report.umwoosung.r0011;
/*try{
 * }
 * catch(Exception e){
 * }try문안의 함수의 값외의것이 나오면 예외처리를 해서 catch(Exception e){}
 * {}안의문구로 대체한다
 * 
 * try{
 * }
 * catch(Exception e){
 * }finally{
 * System.out.println("   ")
 * }
 * finally이뒤의 문구는 무조건 실행된다.
 * 
 * for문을 원하는 값이 나올때까지 반복하고싶다면 예외값이 
 * 나올때마다 --i;를 걸어놓으면 i++값이 되돌아감으로 5번쨰 입력
 * 하는것이라면 5번째가 i++가 되서 6이되지만 예외값이 나올때마다
 * i--가 됨으로 5번째로 되돌아가게된다.
 * 
 * 
 * 
 * 
 * 
 * final int NUM_EXAM = 1; - final은 변수를 무조건 상수값으로 만들어준다.
 * 규칙은 문자를 대문자로쓰고, 두개가 합쳐지면 _로 이어준다.
 * 생성자에서만 값을 선언할수있고, 다른계산에 바뀌지않는다.
 * 클래스와 생성자에서만 값을 초기화 할수있다.
 * 생성자가 여러개인경우 클래스에 값을 선언하지않았다면
 * 무조건 모든생성자에 값이 선언되 있어야한다.
 * 생성자가 2개인데 값이 다를경우는 호출하는것에따라서 값이 달라진다.
 * 
 * 
 * 
 * 
 * 
 */


